Revit 2027 API
DimensionStyleType Enumeration
 An enumerated type containing possible style types of dimensions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DimensionStyleType
Public Enumeration DimensionStyleType
public enum class DimensionStyleType
type DimensionStyleType
Members
Member name | Value | Description
AlignmentStationLabel | 10 |  Alignment Station Label
Angular | 1 |  Angular dimension.
ArcLength | 3 |  ArcLength dimension.
Diameter | 9 |  Diameter dimension.
Linear | 0 |  Linear dimension.
LinearFixed | 7 |  LinearFixed dimension, which is linear dimension whose direction is parallel to X or Y.
Radial | 2 |  Radial dimension.
SpotCoordinate | 5 |  SpotCoordinate
SpotElevation | 4 |  SpotElevation
SpotSlope | 8 |  SpotSlope
See Also
Reference
Autodesk.Revit.DB Namespace